Revit 2027 API
PointOnPlane.GetPlaneReference Method
The geometric plane reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetPlaneReference()
Public Function GetPlaneReference As Reference
public:
Reference^ GetPlaneReference()
member GetPlaneReference : unit -> Reference
Return Value
Reference
A copy of the reference stored in the PointOnPlane object.
See Also
Reference
PointOnPlane Class
Autodesk.Revit.DB Namespace